---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.FamilyId
source: html/4ea3d108-7cf6-c557-89a9-81e52919e8b3.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.FamilyId Property

In a note block schedule, the ID of the Generic Annotation family
 displayed by the schedule.

## Syntax (C#)
```csharp
public ElementId FamilyId { get; }
```

## Remarks
A note block is a schedule of the Generic Annotations category
 that shows elements of a single family rather than all elements
 in the category.